tangyangguang/Esp32_Faucet/src/web/FaucetWebAssets.cpp
#ifndef ESP32BASE_WEB_NATIVE_TEST
#define ESP32BASE_WEB_NATIVE_TEST 0
#endif

#if !defined(NATIVE_BUILD) || ESP32BASE_WEB_NATIVE_TEST

#include "web/FaucetWebAssets.h"

#if ESP32BASE_WEB_NATIVE_TEST
#include "web/Esp32BaseWeb.h"
#else
#include <Esp32Base.h>
#endif

#ifndef FAUCET_WEB_CSS_VERSION
#define FAUCET_WEB_CSS_VERSION __TIME__
#endif

namespace faucet {

void sendAppCss() {
    Esp32BaseWeb::sendChunk(":root{--bg:#f7f9f8;--surface:#fff;--line:#dfe8e5;--text:#243039;--muted:#68767d;--accent:#2f7f75;--accent-soft:#edf6f3}"
                            "body{max-width:1040px;margin:0 auto;padding:14px 16px;background:var(--bg);color:var(--text);font:14px/1.45 -apple-system,BlinkMacSystemFont,'Segoe UI',Arial,'PingFang SC','Microsoft YaHei',sans-serif}"
                            "h1,h2,h3{letter-spacing:0}h2{font-size:20px;margin:18px 0 10px}h3{font-size:15px;margin:0 0 8px}h4{font-size:14px;margin:0 0 6px}p{margin:0 0 8px}.muted,.hint{color:var(--muted)}.hint{display:block;font-size:12px;margin-top:3px}");
    Esp32BaseWeb::sendChunk("nav,.footerbar,.panel,.metric-card,.filter-card,table{background:var(--surface);border:1px solid var(--line);border-radius:6px}"
                            "nav{display:flex;gap:6px;align-items:center;margin:0 0 16px;padding:8px;overflow-x:auto}nav a,.btn-link,.page-link,.page-current,.row-actions a{display:inline-flex;align-items:center;justify-content:center;min-height:30px;padding:0 10px;border:1px solid var(--line);border-radius:6px;background:#f8faf9;color:#305f66;text-decoration:none;box-sizing:border-box}nav a.active,.page-current{background:var(--accent-soft);color:#17635b;border-color:#cfe4dc}.brand{font-weight:750}.footerbar{margin-top:18px;padding:10px 12px}");
    Esp32BaseWeb::sendChunk(".panel{padding:12px;margin:12px 0;overflow-x:auto}.panel-head{display:flex;align-items:center;justify-content:space-between;gap:8px;margin-bottom:8px}.grid,.metric-grid,.filter-cards,.usage-grid,.machine-task-grid,.active-metering-metrics,.calibration-kpi-grid,.tds-calibration-summary,.temperature-calibration-summary{display:grid;grid-template-columns:repeat(auto-fit,minmax(160px,1fr));gap:10px}.metric-card,.filter-card,.metering-metric,.calibration-kpi{padding:10px 12px}.metric-card span,.metering-metric span,.calibration-kpi span{display:block;color:var(--muted);font-size:12px}.metric-card strong,.metering-metric strong,.calibration-kpi strong{display:block;margin-top:4px;font-size:17px}");
    Esp32BaseWeb::sendChunk("table{width:100%;border-collapse:collapse;margin:0 0 12px;font-size:13px}td,th{padding:7px 8px;border-bottom:1px solid #edf1f0;text-align:left;vertical-align:middle}th{background:#f8faf9;color:var(--muted);font-weight:700}.kv th{width:28%}.status-pill{display:inline-flex;align-items:center;min-height:22px;padding:0 8px;border-radius:999px;background:#eef2f2;color:#55616a;font-size:12px;font-weight:650;white-space:nowrap}.status-ok{background:#e8f4ee;color:#21634c}.status-warn{background:#fff7e6;color:#7a520e}.status-error,.err{color:#9b3328}.status-muted{background:#eef2f2;color:#66737c}.warn{display:block;background:#fff8e6;border:1px solid #ead28b;border-radius:6px;padding:8px;color:#6b4a12}");
    Esp32BaseWeb::sendChunk("input,select,button{font:inherit;max-width:100%;box-sizing:border-box}input,select{min-height:32px;padding:5px 8px;border:1px solid var(--line);border-radius:6px;background:#fff;color:var(--text)}input[type=submit],button,.primary,.secondary,.danger{cursor:pointer;border:1px solid var(--line);border-radius:6px;background:#f8faf9;color:#305f66;font-weight:650}input[type=submit],button{min-height:32px;padding:0 12px}.primary{background:var(--accent);border-color:var(--accent);color:#fff}.secondary{background:#f3f6f5}.danger{background:#fff2ef;border-color:#edc5bc;color:#8a3025}");
    Esp32BaseWeb::sendChunk(".form-grid{display:grid;grid-template-columns:repeat(12,1fr);gap:10px 12px}.span-2{grid-column:span 2}.span-3{grid-column:span 3}.span-4{grid-column:span 4}.span-5{grid-column:span 5}.span-6{grid-column:span 6}.span-8{grid-column:span 8}.span-12{grid-column:1/-1}.field span,.compact-field span,.check-title{display:block;color:var(--muted);font-size:12px;font-weight:650;margin-bottom:4px}.check-line{display:flex;align-items:center;gap:6px}.form-actions,.row-actions,.pager,.pager-links,.estimator-input-row{display:flex;align-items:center;gap:6px;flex-wrap:wrap}.form-actions{margin-top:10px}.page-disabled{color:#9aa3aa;pointer-events:none}.disabled-row{color:#8a949b;background:#f7f8f8}");
    Esp32BaseWeb::sendChunk(".machine-main,.today-layout,.record-detail-grid,.calibration-session-layout{display:grid;grid-template-columns:repeat(auto-fit,minmax(260px,1fr));gap:12px}.machine-main{grid-template-columns:minmax(240px,.9fr) minmax(360px,1.5fr);align-items:stretch}.machine-main.compact{grid-template-columns:minmax(280px,.95fr) minmax(360px,1.45fr)}.machine-hero,.machine-overview{min-width:0}.machine-hero{display:flex;flex-direction:column;justify-content:space-between;gap:14px}.machine-hero-head{display:flex;flex-direction:column;gap:12px}.machine-hero strong{font-size:28px;line-height:1.1}.machine-context{min-width:0}.machine-screen-footer{display:flex;align-items:center;gap:8px;color:var(--muted);font-size:13px}");
    Esp32BaseWeb::sendChunk(".next-preset-control{display:grid;grid-template-columns:34px minmax(0,1fr) 34px;align-items:center;gap:8px}.preset-step{width:34px;height:34px;padding:0;background:#1d7584;border-color:#1d7584;color:#fff;font-size:22px;line-height:1}.next-preset-copy{min-width:0}.next-preset-copy span,.machine-task-card span,.machine-status-item span,.today-summary-label{display:block;color:var(--muted);font-size:12px;font-weight:650}.next-preset-copy strong{display:block;font-size:18px;line-height:1.25;word-break:break-word}.next-preset-copy small{display:block;color:var(--muted);margin-top:3px}.machine-task-grid{grid-template-columns:repeat(2,minmax(0,1fr))}.machine-task-card strong,.today-total-main{font-size:24px;line-height:1.15}.machine-task-card small{display:block;color:var(--muted);margin-top:3px}");
    Esp32BaseWeb::sendChunk(".machine-status-strip{display:flex;align-items:stretch;gap:8px;flex-wrap:wrap;margin-top:10px}.machine-status-item{display:inline-flex;flex-direction:column;gap:2px;min-width:82px;padding:7px 9px;border:1px solid #edf1f0;border-radius:6px;background:#fbfcfc}.machine-status-item strong{font-size:14px}.machine-status-note,.sensor-unit{color:var(--muted);font-size:12px}.machine-alert{padding:8px;border-radius:6px;background:#edf6f3;color:#17635b}.machine-progress-head{display:flex;justify-content:space-between;gap:8px;margin-bottom:6px}.progress,.filter-track{height:8px;background:#e2e9e7;border-radius:999px;overflow:hidden}.progress span,.filter-progress-fill{display:block;height:100%;background:var(--accent)}");
    Esp32BaseWeb::sendChunk(".today-layout{grid-template-columns:minmax(220px,.8fr) minmax(360px,1.4fr)}.today-summary-card{display:flex;align-items:center;gap:6px;flex-wrap:wrap}.today-total-meta,.today-meta-line{display:flex;align-items:center;gap:8px;flex-wrap:wrap;color:var(--muted)}.today-meta-value{color:var(--text);font-weight:650}.today-records,.calibration-param-panel{overflow-x:auto}.calibration-slot-table,.today-record-table,.calibration-sample-table{min-width:760px}.filter-head,.filter-meta,.filter-progress-row{display:flex;gap:8px}.filter-head{align-items:center;justify-content:space-between;margin-bottom:8px}.filter-meta{flex-direction:column;color:var(--muted);font-size:13px}.filter-progress-row{align-items:center;margin:6px 0}.filter-progress-row b{min-width:32px}.filter-track{flex:1}");
    Esp32BaseWeb::sendChunk(".metering-metric,.calibration-kpi{border:1px solid #edf1f0;border-radius:6px;background:#fbfcfc}.active-metering-name{font-weight:650}.scheme-param-lines{display:flex;flex-direction:column;gap:3px}.calibration-session-badges{display:flex;gap:6px;flex-wrap:wrap}.calibration-primary-actions,.calibration-secondary-actions{align-items:flex-end}.generated-metering-candidate,.tds-workflow-card,.tds-step-card{padding:10px;border:1px solid #edf1f0;border-radius:6px;background:#fbfcfc}.unit-label{display:inline-flex;align-items:center;padding:0 8px;color:var(--muted)}.inline-note{color:var(--muted);font-size:12px}.ok{color:#21634c}");
    Esp32BaseWeb::sendChunk(".panel h3{padding-bottom:6px;margin-bottom:8px;border-bottom:1px solid #eef2f1}.panel-head{padding-bottom:7px;border-bottom:1px solid #eef2f1}.panel-head h3{padding:0;margin:0;border:0}.machine-status{padding:14px 16px;margin:0 0 14px;border-color:#d8e1e6;background:#fbfcfd}.machine-main{grid-template-columns:minmax(280px,.36fr) minmax(0,.64fr);gap:16px}.machine-main.compact{grid-template-columns:minmax(250px,.36fr) minmax(0,.64fr)}.machine-hero{position:relative;justify-content:center;min-height:106px}.machine-main:not(.compact) .machine-hero{justify-content:space-between;min-height:146px}.machine-hero-head{display:grid;grid-template-columns:max-content minmax(0,1fr);align-items:center;gap:14px}.machine-hero strong{display:block;font-size:31px;font-weight:700}");
    Esp32BaseWeb::sendChunk(".machine-screen-footer{position:absolute;left:0;bottom:0;display:inline-flex;align-items:center;gap:5px;min-height:22px;color:#8a949b;font-size:12px;line-height:1}.machine-main:not(.compact) .machine-screen-footer{position:static;margin-top:10px}.machine-context{display:flex;flex-direction:column;gap:6px}.machine-alert{margin:0;color:#8a6f3d;background:transparent;padding:0;font-size:13px;line-height:1.35}.machine-progress-alert{margin:8px 0 0}.next-preset-control{grid-template-columns:30px minmax(0,1fr) 30px;gap:7px;max-width:430px}.preset-step{display:inline-flex;width:30px;height:30px;background:#fff;border-color:#dce4ea;color:#315f68;font-size:20px}.next-preset-copy>span{font-size:11px;line-height:1.1;margin-bottom:2px}.next-preset-copy strong{font-size:13px;font-weight:650;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}.next-preset-copy small{font-size:11px;line-height:1.18;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}");
    Esp32BaseWeb::sendChunk(".machine-task-grid{display:grid;grid-template-columns:repeat(4,minmax(0,1fr));gap:8px}.machine-task-card{display:flex;flex-direction:column;justify-content:center;min-height:68px;padding:11px 12px;border:1px solid #dde6eb;border-radius:7px;background:#fff;box-shadow:0 1px 2px rgba(16,24,40,.025)}.machine-task-card span{font-size:12px;font-weight:400;margin-bottom:3px}.machine-task-card strong{font-size:17px;font-weight:600;color:var(--text)}.machine-task-card small{font-size:11px;line-height:1.2;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}.machine-status-strip{align-items:center;gap:7px;margin-top:0}.machine-status-item{display:inline-flex;flex-direction:row;align-items:center;gap:5px;min-height:28px;min-width:0;padding:0 9px;border:1px solid #dce4ea;border-radius:999px;background:#f7f9fb;color:#66737c;font-size:12px;line-height:1}.machine-status-item strong{font-size:13px;color:#35424c}.machine-status-note,.sensor-unit{font-size:11px;white-space:nowrap}");
    Esp32BaseWeb::sendChunk(".today-layout{grid-template-columns:minmax(190px,.28fr) minmax(0,1.72fr);gap:12px;margin:0 0 14px}.today-summary-card{flex-direction:column;align-items:flex-start;justify-content:flex-start;min-height:92px;padding:14px 16px}.today-summary-label{font-size:13px;font-weight:400;line-height:1.35;margin-bottom:6px}.today-total-main{font-size:26px;font-weight:700}.today-total-meta{gap:3px 8px;font-size:13px;margin-top:8px}.today-meta-item{display:inline-flex;align-items:baseline;gap:3px;white-space:nowrap}.today-meta-item+.today-meta-item:before{content:'·';margin-right:5px;color:#a2adb4}.today-records{padding:8px 10px}.today-record-table{min-width:680px;margin:0;border:0;border-radius:0;box-shadow:none;background:transparent}.filter-cards{grid-template-columns:repeat(auto-fit,minmax(250px,1fr));gap:10px;margin:0 0 12px}.filter-card{padding:12px 14px;min-height:128px}.filter-head{align-items:flex-start;justify-content:space-between}.filter-head strong{font-size:16px;font-weight:750}.filter-meta{display:grid;margin-top:10px}.dual-progress{display:grid;gap:7px;margin:8px 0 10px}.filter-progress-row{display:grid;grid-template-columns:48px 1fr}.day-progress{background:var(--accent)}.flow-progress{background:#c9822c}");
    Esp32BaseWeb::sendChunk(".status-pill{border:1px solid transparent;line-height:1}.status-ok{border-color:#bdddcf}.status-warn{border-color:#eed28f}.status-error{background:#fff0ee;color:#9b3328;border-color:#efc1ba}.status-muted{border-color:#d8e0df}.temperature-calibration-summary{grid-template-columns:repeat(2,minmax(0,1fr));margin:10px 0 12px}.tds-calibration-summary{grid-template-columns:repeat(4,minmax(0,1fr));margin:10px 0 12px}.temperature-calibration-summary>div,.tds-calibration-summary>div{min-width:0;padding:10px;border:1px solid #edf2f1;border-radius:6px;background:#fbfdfc}.temperature-calibration-summary span,.tds-calibration-summary span{display:block;color:var(--muted);font-size:12px;font-weight:650}.temperature-calibration-summary strong,.tds-calibration-summary strong{display:block;margin-top:5px;color:var(--text);font-size:17px;line-height:1.2;font-weight:750;font-variant-numeric:tabular-nums;overflow-wrap:anywhere}.temperature-calibration-form,.sample-calibration-form,.tds-capture-form{min-width:0}.tds-workflow-card h4{margin:0 0 6px;color:#2f3d45;font-size:14px}.tds-workflow-card p{color:#536068;font-size:12px;line-height:1.45}.tds-point-session table form{display:inline-flex;margin:0}");
    Esp32BaseWeb::sendChunk(".active-metering-card{overflow:visible}.active-metering-name{margin:2px 0 0;color:#22313a;font-size:18px;font-weight:750;line-height:1.25}.active-metering-metrics{grid-template-columns:repeat(auto-fit,minmax(96px,1fr));gap:7px;margin-top:10px}.metering-metric{min-width:0;padding:7px 8px;border:1px solid #e1ebe8;border-radius:6px;background:#fbfdfc}.metering-metric span{margin-bottom:3px;font-size:11px;font-weight:650}.metering-metric strong{font-size:14px;font-weight:760;font-variant-numeric:tabular-nums;white-space:nowrap;overflow:hidden;text-overflow:ellipsis}.metering-scheme-table td{vertical-align:top;white-space:normal}.scheme-param-lines{display:grid;gap:3px}.scheme-param-lines span{display:block;white-space:nowrap}.calibration-param-layout{display:grid;grid-template-columns:1fr;gap:12px;margin:0 0 12px}.calibration-param-layout .calibration-param-panel{margin:0}.calibration-slot-table{table-layout:fixed;min-width:980px;margin:0;border:0;border-radius:0;box-shadow:none;background:transparent}.generated-metering-candidate{margin-top:10px}.estimator-input-row{display:flex!important;align-items:stretch;width:100%;margin:0!important}.estimator-input-row input{flex:1 1 auto;min-width:0;margin:0;text-align:right;border-top-right-radius:0;border-bottom-right-radius:0}.unit-label{justify-content:center;min-width:42px;margin:0!important;border:1px solid var(--line);border-left:0;border-radius:0 6px 6px 0;background:#f7f9fa;font-weight:650}");
    Esp32BaseWeb::sendChunk("@media(max-width:720px){body{padding:10px}.form-grid{grid-template-columns:1fr}.span-2,.span-3,.span-4,.span-5,.span-6,.span-8,.span-12{grid-column:1/-1}.machine-main,.machine-main.compact,.today-layout{grid-template-columns:1fr}.machine-task-grid{grid-template-columns:1fr}.panel-head{align-items:flex-start;flex-direction:column}.today-summary-card{align-items:flex-start;flex-direction:column}} ");
}

void sendAppStylesheetLink() {
    Esp32BaseWeb::sendChunk("<link rel='stylesheet' href='/faucet/app.css?v=" FAUCET_WEB_CSS_VERSION "'>");
}

